{"pageProps":{"content":"# 5 Notes on How to Design a Resilient UI\n\nThe most interesting things happen once your software is in real use.\nThat's when you can really see what's working and what to change.\n\nIt brings us to the problem of editing already working thing. In the wild.\nIt happens all the time. Don't think you can predict the future.\nYou need to design your software with ease of modification in mind.\n\nHere are some ideas how to do that:\n\n## Modularity\n\nModular UIs are easier to edit in the long run.\nWhen your interface is divided into distinct parts,\nyou can also separate chunks of code by following that divisions.\nThat way changes will be way less tedious. For instance:\n\n1. You can just swap UI modules in an HTML or template file.\n2. You can edit a module in its own file — no need to dig into complex code\nthat's responsible for many things.\n\n## Embrace Foundations\n\nIf I need to pick between working on something essential or adding\nbells and whistles, I pick essentials.\nIt's just hard to be really good at all of them,\nso why even focus on *nice to haves*?\nWhat usually piss people off is fundamentals refusing to work as they\nshould — not lack of *bahama yellow* in a color palette.\n\nWorking extra on things like clarity (intuitiveness, readability) and speed\nwill give you more than any neophiliac thing.\n\n## Simplicity is Tricky\n\nIt's easy to achieve perceived simplicity and pay for it with real complexity.\nFor instance,\nyou can make an intuitive UI while ignoring clarity of its implementation.\nSooner or later it will cause all kinds of unexpected problems.\nReal simplicity of an interface means neat visuals **and** clear implementation.\nTo achieve that, you often need to sacrifice some non-crucial features.\nAnd remember about *YAGNI*.\n\n## Smooth Interactions\n\nThere's an overwhelming variety of internet browsing devices on the market.\nWe need to think about what will make the product work smoothly on\na sub-average hardware and half-decent wi-fi.\nPeople will often use your stuff at train stations,\nairports or in restaurants.\nAnd they will use more than one app/website at the same time.\nHow many browser tabs do you have open right now?\n\n(There's a good article in this matter:\n[Optimizing for Fan Noise](http://prog21.dadgum.com/61.html))\n\n## Words Win\n\nPeople say “a picture is like a thousand words”.\nBut a picture will not make a proposition as clear and precise\nas a well designed sentence or phrase.\nText is also trivial to edit.\nThat's why I like typography — it's a tool to achieve clarity and flexibility.\n\nDon't overthink that weird icon. If it's not obvious, text will be better.\n\n<small>2017-04-05</small>\n"},"__N_SSG":true}