{"pageProps":{"htmlContent":"<h1>Old Programming Wisdom Beats Crowdsourced Advice</h1>\n<p>People find safety in following popular opinions. They see it as something of high value — worth sacrificing trust in their instincts.\nThis is why I like to look for advice by turning to individuals who\nshow signs of independent thinking and achieved something worth admiring.</p>\n<p>My default attitude towards something that helps in groupthink, like forums and comment threads, is perceiving it as a waste of time. However, StackOverflow surprised me. I also remember finding some useful discussions on Reddit. But these are exceptions. <strong>Personal</strong> blogs and vlogs, or essay collections like\n<a href=\"http://www.paulgraham.com\">paulgraham.com</a>, are still my favorite mediums.</p>\n<p>Being <strong>good at avoiding groupthink</strong>, which includes so-called “industry standards,” is on point.\nAn average set of methods of the top 50% of professionals is a way different thing than what you get by analyzing how the top 10% operates.\nWhen someone starts advising you with, “today, most people,” don't expect a productive discussion.</p>\n<p>Below is a couple of quotes of people who did something right and we can learn from them.\nIt's not the kind of content you see often. There are many programs written in contradiction to these ideas.\n(Note: it's not a top-list.)</p>\n<br>\n<blockquote>\n<p>Somehow the idea of reusability got attached to object-oriented programming in the 1980s, and no amount of evidence to the contrary seems to be able to shake it free. But although some object-oriented software is reusable, what makes it reusable is its bottom-upness, not its object-orientedness. Consider libraries: they're reusable because they're language, whether they're written in an object-oriented style or not.</p>\n</blockquote>\n<p>— Paul Graham, <a href=\"http://www.paulgraham.com/hundred.html\"><em>The Hundred-Year Language</em></a>.</p>\n<br>\n  <div class=\"video-wrapper\">\n    <iframe\n      src=\"https://www.youtube.com/embed/75Ju0eM5T2c\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen>\n    </iframe>\n  </div>\n<p>— Donald Knuth, <em>Web of Stories</em>.</p>\n<br>\n<blockquote>\n<p>Abstraction trades an increase in real complexity for a decrease in perceived complexity. That isn't always a win.</p>\n</blockquote>\n<p>— <a href=\"https://twitter.com/id_aa_carmack/status/835164026984243201\">John Carmack</a></p>\n<br>\n<blockquote>\n<p>The problem with object-oriented languages is they’ve got all this implicit environment that they carry around with them. You wanted a banana but what you got was a gorilla holding the banana and the entire jungle.</p>\n</blockquote>\n<blockquote>\n<p>If you have referentially transparent code, if you have pure functions — all the data comes in its input arguments and everything goes out and leave no state behind — it’s incredibly reusable.</p>\n</blockquote>\n<p>— Joe Armstrong, <em>Coders at Work</em>.</p>\n<br>\n<blockquote>\n<p>The World Wide Web was precisely what we were trying to PREVENT— ever-breaking links, links going outward only, quotes you can't follow to their origins, no version management, no rights management.</p>\n</blockquote>\n<p>— <a href=\"http://xanadu.com.au/ted/XU/XuPageKeio.html\">Ted Nelson</a></p>\n<br>\n<p>That's it. Time for a walk.</p>\n<p><code>2018-08-04</code></p>","title":"Old Programming Wisdom Beats Crowdsourced Advice"},"__N_SSG":true}