{"pageProps":{"content":"# We're so Bad at Judging Complexity, yet We Like to Predict\n## (Getting Perspective on Complexity)\n\nLiving in a bubble, the one that's unavoidable, makes us misjudge what are\nthe most complex things we have to face.\nWe think that some technical (software/hardware) problems are\nthe most convoluted ones, but actually,\neveryday things like traffic or sales are way more complex.\n\nIf you deal with software development,\nyou have to be more analytical about dependencies and scale than\nsales people or taxi drivers. But you're not in a more convoluted environment.\nIt's just a difference in awareness.\n\nGood example of bad awareness are people who eagerly try to figure out\nextremely nuanced events,\nwith confidence that it will do something positive, for sure not harm,\njust because they acquired some software to do some statistics.\nImagine management people trying to find out what their potential clients\nreally want, by looking at stats and surveys.\n\nNow lets look at one salesman. He knows that he can select and call ten\ndifferent prospects and get “no” from nine of them (or even all ten).\nHe will keep trying. He will\nadjust the course — build new heuristics — every time he notices a pattern.\nHowever, he will never figure\nout a theory that universally explains what makes people buy, so that he\ncan predict decisions, or call only those who will almost for sure say “yes”.\nAnd this will be OK — he will do well anyway.\nPeople like him don't bother to do much calculation or predictions —\nit's impossible to figure out all the stuff\nthat's going on in this kind of situation.\nThey just progressively iterate, tinker, observe and judge.\nAnd they accept that they will never know everything.\n\nJust because your environment is complicated doesn't mean that you need to\nunderstand all its aspects to get by.\nIt's about iteration and couple of good heuristics — not predictiveness.\nOn the other hand, learning something commonly known as\nhard and complicated doesn't mean that your abilities to predict\nthe future are now greater.\nIn the big picture it's just a bird shit –\nfar from what you need to process to get all the nuances of a market\n(or similar *yuge* context problem).\n\n<small>2018-06-01</small>\n"},"__N_SSG":true}