{"pageProps":{"content":"# Henry Ford for Makers: Quotes on Design\n\nThese are short excerpts from Henry Ford's “My Life and Work”. I picked\nthe ones that will be helpful especially to makers — designers, developers, etc.\n\n## Simplicity\n\n> My effort is in the direction of simplicity.\n...\nBecause nearly everything that we make is much\nmore complex than it needs to be.\nOur clothing, our food, our household furnishings—all could be\nmuch simpler than they now are and at the same time be better looking.\n\n## Work/Money\n\n> Thinking first of money instead of work brings on fear of failure\nand this fear blocks every avenue of business—it makes a man afraid\nof competition, of changing his methods, or of doing anything which\nmight change his condition.\n\n> The way is clear for any one who thinks first of service—of\ndoing the work in the best possible way.\n\n> Manufacturing is not buying low and selling high.\nIt is the process of buying materials fairly and,\nwith the smallest possible addition of cost,\ntransforming those materials into a consumable product and giving it\nto the consumer.\nGambling, speculating, and sharp dealing, tend only to clog this progression.\n\n## Practicality\n\n> If you travel the roads in the neighbourhood of Dearborn you can\nfind all sorts of models of Ford cars.\nThey are experimental cars—they are not new models.\n...\nIf an idea seems good or seems even to have possibilities,\nI believe in doing whatever is necessary to test out the idea from every angle.\n\n> The \"Model T\" had practically no features which were not contained\nin some one or other of the previous models.\nEvery detail had been fully tested in practice.\n\n> The men often try out little attachments of their own because,\nconcentrating on one thing, they can, if they have a mind that way,\nusually devise some improvement.\n\n> None of our machines is ever built haphazardly. ...\nSometimes wooden models are constructed or again the parts are drawn\nto full size on a blackboard. We are not bound by precedent but we\nleave nothing to luck.\n\n## <s>Common Knowledge</s>\n\n> If ever I wanted to kill opposition by unfair means I would endow\nthe opposition with experts.\nThey would have so much good advice that I could be sure\nthey would do little work.\n\n> Where most manufacturers find themselves quicker to make a change\nin the product than in the method of manufacturing—we follow\nexactly the opposite course.\n\n> I cannot discover that any one knows enough about anything on this\nearth definitely to say what is and what is not possible.\n\n**“Nearly everything that we make is much more complex\nthan it needs to be”**\n\n<small>2015-11-10</small>\n","title":"Henry Ford for Makers: Quotes on Design"},"__N_SSG":true}